_protected/views/hotel/_form.php

  </div>
  <div class="row">
    <div class="col-xs-12">
      <?= $form->field($model, 'amenity_ids')->checkboxList(
        ArrayHelper::map(\app\models\Amenity::find()->where(['status' => 1])->all(), 'id', 'title')
      ) ?>
---
SELECT * FROM `ut_amenities` WHERE `status`=1