_protected/controllers/HotelController.php

INSERT INTO `ut_hotels` (`status`, `title`, `description`) VALUES (1, 'Luxuries Hotel', 'Integer legentibus erat a ante historiarum dapibus. Pellentesque habitant morbi tristique senectus et netus. Ab illo tempore, ab est sed immemorabili. Tu quoque, Brute, fili mi, nihil timor populi, nihil! Prima luce, cum quibus mons aliud consensu ab eo. Quis aute iure reprehenderit in voluptate velit esse.\r\nQuo usque tandem abutere, Catilina, patientia nostra? Contra legem facit qui id facit quod lex prohibet. Cum sociis natoque penatibus et magnis dis parturient. Lorem ipsum dolor sit amet, consectetur adipisici elit, sed eiusmod tempor incidunt ut labore et dolore magna aliqua.\r\nIdque Caesaris facere voluntate liceret: sese habere. Tityre, tu patulae recubans sub tegmine fagi dolor. At nos hinc posthac, sitientis piros Afros. Fabio vel iudice vincam, sunt in culpa qui officia. Gallia est omnis divisa in partes tres, quarum. Etiam habebis sem dicantur magna mollis euismod.')
---
    public function actionCreate(){
      $model = new Hotel();

      if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `ut_hotels` WHERE `id`='3'
---
    protected function findModel($id)
    {
        if (($model = Hotel::findOne($id)) !== null) {